---
kind: type
id: T:Autodesk.Revit.DB.BuiltInFailures.FabricSheetFailures
source: html/aeba175c-2389-de20-ab89-49bfaa3fa150.htm
---
# Autodesk.Revit.DB.BuiltInFailures.FabricSheetFailures

Failures related to fabric sheet elements.

## Syntax (C#)
```csharp
public static class FabricSheetFailures
```